MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_LAN9253/firmware/src/packs/ATSAMD51J19A_DFP/component/sdhc.h
/* -------- SDHC_NISTER : (SDHC Offset: 0x34) (R/W 16) Normal Interrupt Status Enable -------- */
#define SDHC_NISTER_RESETVALUE                _U_(0x00)                                            /**<  (SDHC_NISTER) Normal Interrupt Status Enable  Reset Value */

#define SDHC_NISTER_CMDC_Pos                  _U_(0)                                               /**< (SDHC_NISTER) Command Complete Status Enable Position */
#define SDHC_NISTER_CMDC_Msk                  (_U_(0x1) << SDHC_NISTER_CMDC_Pos)                   /**< (SDHC_NISTER) Command Complete Status Enable Mask */
#define SDHC_NISTER_CMDC(value)               (SDHC_NISTER_CMDC_Msk & ((value) << SDHC_NISTER_CMDC_Pos))
#define   SDHC_NISTER_CMDC_MASKED_Val         _U_(0x0)                                             /**< (SDHC_NISTER) Masked  */
#define   SDHC_NISTER_CMDC_ENABLED_Val        _U_(0x1)                                             /**< (SDHC_NISTER) Enabled  */
#define SDHC_NISTER_CMDC_MASKED               (SDHC_NISTER_CMDC_MASKED_Val << SDHC_NISTER_CMDC_Pos) /**< (SDHC_NISTER) Masked Position  */
#define SDHC_NISTER_CMDC_ENABLED              (SDHC_NISTER_CMDC_ENABLED_Val << SDHC_NISTER_CMDC_Pos) /**< (SDHC_NISTER) Enabled Position  */
#define SDHC_NISTER_TRFC_Pos                  _U_(1)                                               /**< (SDHC_NISTER) Transfer Complete Status Enable Position */
#define SDHC_NISTER_TRFC_Msk                  (_U_(0x1) << SDHC_NISTER_TRFC_Pos)                   /**< (SDHC_NISTER) Transfer Complete Status Enable Mask */
#define SDHC_NISTER_TRFC(value)               (SDHC_NISTER_TRFC_Msk & ((value) << SDHC_NISTER_TRFC_Pos))
#define   SDHC_NISTER_TRFC_MASKED_Val         _U_(0x0)                                             /**< (SDHC_NISTER) Masked  */
#define   SDHC_NISTER_TRFC_ENABLED_Val        _U_(0x1)                                             /**< (SDHC_NISTER) Enabled  */
#define SDHC_NISTER_TRFC_MASKED               (SDHC_NISTER_TRFC_MASKED_Val << SDHC_NISTER_TRFC_Pos) /**< (SDHC_NISTER) Masked Position  */
#define SDHC_NISTER_TRFC_ENABLED              (SDHC_NISTER_TRFC_ENABLED_Val << SDHC_NISTER_TRFC_Pos) /**< (SDHC_NISTER) Enabled Position  */
#define SDHC_NISTER_BLKGE_Pos                 _U_(2)                                               /**< (SDHC_NISTER) Block Gap Event Status Enable Position */
#define SDHC_NISTER_BLKGE_Msk                 (_U_(0x1) << SDHC_NISTER_BLKGE_Pos)                  /**< (SDHC_NISTER) Block Gap Event Status Enable Mask */
#define SDHC_NISTER_BLKGE(value)              (SDHC_NISTER_BLKGE_Msk & ((value) << SDHC_NISTER_BLKGE_Pos))
#define   SDHC_NISTER_BLKGE_MASKED_Val        _U_(0x0)                                             /**< (SDHC_NISTER) Masked  */
#define   SDHC_NISTER_BLKGE_ENABLED_Val       _U_(0x1)                                             /**< (SDHC_NISTER) Enabled  */
#define SDHC_NISTER_BLKGE_MASKED              (SDHC_NISTER_BLKGE_MASKED_Val << SDHC_NISTER_BLKGE_Pos) /**< (SDHC_NISTER) Masked Position  */
#define SDHC_NISTER_BLKGE_ENABLED             (SDHC_NISTER_BLKGE_ENABLED_Val << SDHC_NISTER_BLKGE_Pos) /**< (SDHC_NISTER) Enabled Position  */
#define SDHC_NISTER_DMAINT_Pos                _U_(3)                                               /**< (SDHC_NISTER) DMA Interrupt Status Enable Position */
#define SDHC_NISTER_DMAINT_Msk                (_U_(0x1) << SDHC_NISTER_DMAINT_Pos)                 /**< (SDHC_NISTER) DMA Interrupt Status Enable Mask */
#define SDHC_NISTER_DMAINT(value)             (SDHC_NISTER_DMAINT_Msk & ((value) << SDHC_NISTER_DMAINT_Pos))
#define   SDHC_NISTER_DMAINT_MASKED_Val       _U_(0x0)                                             /**< (SDHC_NISTER) Masked  */
#define   SDHC_NISTER_DMAINT_ENABLED_Val      _U_(0x1)                                             /**< (SDHC_NISTER) Enabled  */
#define SDHC_NISTER_DMAINT_MASKED             (SDHC_NISTER_DMAINT_MASKED_Val << SDHC_NISTER_DMAINT_Pos) /**< (SDHC_NISTER) Masked Position  */
#define SDHC_NISTER_DMAINT_ENABLED            (SDHC_NISTER_DMAINT_ENABLED_Val << SDHC_NISTER_DMAINT_Pos) /**< (SDHC_NISTER) Enabled Position  */
#define SDHC_NISTER_BWRRDY_Pos                _U_(4)                                               /**< (SDHC_NISTER) Buffer Write Ready Status Enable Position */
#define SDHC_NISTER_BWRRDY_Msk                (_U_(0x1) << SDHC_NISTER_BWRRDY_Pos)                 /**< (SDHC_NISTER) Buffer Write Ready Status Enable Mask */
#define SDHC_NISTER_BWRRDY(value)             (SDHC_NISTER_BWRRDY_Msk & ((value) << SDHC_NISTER_BWRRDY_Pos))
#define   SDHC_NISTER_BWRRDY_MASKED_Val       _U_(0x0)                                             /**< (SDHC_NISTER) Masked  */
#define   SDHC_NISTER_BWRRDY_ENABLED_Val      _U_(0x1)                                             /**< (SDHC_NISTER) Enabled  */
#define SDHC_NISTER_BWRRDY_MASKED             (SDHC_NISTER_BWRRDY_MASKED_Val << SDHC_NISTER_BWRRDY_Pos) /**< (SDHC_NISTER) Masked Position  */
#define SDHC_NISTER_BWRRDY_ENABLED            (SDHC_NISTER_BWRRDY_ENABLED_Val << SDHC_NISTER_BWRRDY_Pos) /**< (SDHC_NISTER) Enabled Position  */
#define SDHC_NISTER_BRDRDY_Pos                _U_(5)                                               /**< (SDHC_NISTER) Buffer Read Ready Status Enable Position */
#define SDHC_NISTER_BRDRDY_Msk                (_U_(0x1) << SDHC_NISTER_BRDRDY_Pos)                 /**< (SDHC_NISTER) Buffer Read Ready Status Enable Mask */
#define SDHC_NISTER_BRDRDY(value)             (SDHC_NISTER_BRDRDY_Msk & ((value) << SDHC_NISTER_BRDRDY_Pos))
#define   SDHC_NISTER_BRDRDY_MASKED_Val       _U_(0x0)                                             /**< (SDHC_NISTER) Masked  */
#define   SDHC_NISTER_BRDRDY_ENABLED_Val      _U_(0x1)                                             /**< (SDHC_NISTER) Enabled  */
#define SDHC_NISTER_BRDRDY_MASKED             (SDHC_NISTER_BRDRDY_MASKED_Val << SDHC_NISTER_BRDRDY_Pos) /**< (SDHC_NISTER) Masked Position  */
#define SDHC_NISTER_BRDRDY_ENABLED            (SDHC_NISTER_BRDRDY_ENABLED_Val << SDHC_NISTER_BRDRDY_Pos) /**< (SDHC_NISTER) Enabled Position  */
#define SDHC_NISTER_CINS_Pos                  _U_(6)                                               /**< (SDHC_NISTER) Card Insertion Status Enable Position */
#define SDHC_NISTER_CINS_Msk                  (_U_(0x1) << SDHC_NISTER_CINS_Pos)                   /**< (SDHC_NISTER) Card Insertion Status Enable Mask */
#define SDHC_NISTER_CINS(value)               (SDHC_NISTER_CINS_Msk & ((value) << SDHC_NISTER_CINS_Pos))
#define   SDHC_NISTER_CINS_MASKED_Val         _U_(0x0)                                             /**< (SDHC_NISTER) Masked  */
#define   SDHC_NISTER_CINS_ENABLED_Val        _U_(0x1)                                             /**< (SDHC_NISTER) Enabled  */
#define SDHC_NISTER_CINS_MASKED               (SDHC_NISTER_CINS_MASKED_Val << SDHC_NISTER_CINS_Pos) /**< (SDHC_NISTER) Masked Position  */
#define SDHC_NISTER_CINS_ENABLED              (SDHC_NISTER_CINS_ENABLED_Val << SDHC_NISTER_CINS_Pos) /**< (SDHC_NISTER) Enabled Position  */
#define SDHC_NISTER_CREM_Pos                  _U_(7)                                               /**< (SDHC_NISTER) Card Removal Status Enable Position */
#define SDHC_NISTER_CREM_Msk                  (_U_(0x1) << SDHC_NISTER_CREM_Pos)                   /**< (SDHC_NISTER) Card Removal Status Enable Mask */
#define SDHC_NISTER_CREM(value)               (SDHC_NISTER_CREM_Msk & ((value) << SDHC_NISTER_CREM_Pos))
#define   SDHC_NISTER_CREM_MASKED_Val         _U_(0x0)                                             /**< (SDHC_NISTER) Masked  */
#define   SDHC_NISTER_CREM_ENABLED_Val        _U_(0x1)                                             /**< (SDHC_NISTER) Enabled  */
#define SDHC_NISTER_CREM_MASKED               (SDHC_NISTER_CREM_MASKED_Val << SDHC_NISTER_CREM_Pos) /**< (SDHC_NISTER) Masked Position  */
#define SDHC_NISTER_CREM_ENABLED              (SDHC_NISTER_CREM_ENABLED_Val << SDHC_NISTER_CREM_Pos) /**< (SDHC_NISTER) Enabled Position  */
#define SDHC_NISTER_CINT_Pos                  _U_(8)                                               /**< (SDHC_NISTER) Card Interrupt Status Enable Position */
#define SDHC_NISTER_CINT_Msk                  (_U_(0x1) << SDHC_NISTER_CINT_Pos)                   /**< (SDHC_NISTER) Card Interrupt Status Enable Mask */
#define SDHC_NISTER_CINT(value)               (SDHC_NISTER_CINT_Msk & ((value) << SDHC_NISTER_CINT_Pos))
#define   SDHC_NISTER_CINT_MASKED_Val         _U_(0x0)                                             /**< (SDHC_NISTER) Masked  */
#define   SDHC_NISTER_CINT_ENABLED_Val        _U_(0x1)                                             /**< (SDHC_NISTER) Enabled  */
#define SDHC_NISTER_CINT_MASKED               (SDHC_NISTER_CINT_MASKED_Val << SDHC_NISTER_CINT_Pos) /**< (SDHC_NISTER) Masked Position  */
#define SDHC_NISTER_CINT_ENABLED              (SDHC_NISTER_CINT_ENABLED_Val << SDHC_NISTER_CINT_Pos) /**< (SDHC_NISTER) Enabled Position  */
#define SDHC_NISTER_Msk                       _U_(0x01FF)                                          /**< (SDHC_NISTER) Register Mask  */

/* EMMC mode */
#define SDHC_NISTER_EMMC_BOOTAR_Pos           _U_(14)                                              /**< (SDHC_NISTER) Boot Acknowledge Received Status Enable Position */
#define SDHC_NISTER_EMMC_BOOTAR_Msk           (_U_(0x1) << SDHC_NISTER_EMMC_BOOTAR_Pos)            /**< (SDHC_NISTER) Boot Acknowledge Received Status Enable Mask */
#define SDHC_NISTER_EMMC_BOOTAR(value)        (SDHC_NISTER_EMMC_BOOTAR_Msk & ((value) << SDHC_NISTER_EMMC_BOOTAR_Pos))
#define SDHC_NISTER_EMMC_Msk                  _U_(0x4000)                                           /**< (SDHC_NISTER_EMMC) Register Mask  */


/* -------- SDHC_EISTER : (SDHC Offset: 0x36) (R/W 16) Error Interrupt Status Enable -------- */
#define SDHC_EISTER_RESETVALUE                _U_(0x00)                                            /**<  (SDHC_EISTER) Error Interrupt Status Enable  Reset Value */

#define SDHC_EISTER_CMDTEO_Pos                _U_(0)                                               /**< (SDHC_EISTER) Command Timeout Error Status Enable Position */
#define SDHC_EISTER_CMDTEO_Msk                (_U_(0x1) << SDHC_EISTER_CMDTEO_Pos)                 /**< (SDHC_EISTER) Command Timeout Error Status Enable Mask */
#define SDHC_EISTER_CMDTEO(value)             (SDHC_EISTER_CMDTEO_Msk & ((value) << SDHC_EISTER_CMDTEO_Pos))
#define   SDHC_EISTER_CMDTEO_MASKED_Val       _U_(0x0)                                             /**< (SDHC_EISTER) Masked  */
#define   SDHC_EISTER_CMDTEO_ENABLED_Val      _U_(0x1)                                             /**< (SDHC_EISTER) Enabled  */
#define SDHC_EISTER_CMDTEO_MASKED             (SDHC_EISTER_CMDTEO_MASKED_Val << SDHC_EISTER_CMDTEO_Pos) /**< (SDHC_EISTER) Masked Position  */
#define SDHC_EISTER_CMDTEO_ENABLED            (SDHC_EISTER_CMDTEO_ENABLED_Val << SDHC_EISTER_CMDTEO_Pos) /**< (SDHC_EISTER) Enabled Position  */
#define SDHC_EISTER_CMDCRC_Pos                _U_(1)                                               /**< (SDHC_EISTER) Command CRC Error Status Enable Position */
#define SDHC_EISTER_CMDCRC_Msk                (_U_(0x1) << SDHC_EISTER_CMDCRC_Pos)                 /**< (SDHC_EISTER) Command CRC Error Status Enable Mask */
#define SDHC_EISTER_CMDCRC(value)             (SDHC_EISTER_CMDCRC_Msk & ((value) << SDHC_EISTER_CMDCRC_Pos))
#define   SDHC_EISTER_CMDCRC_MASKED_Val       _U_(0x0)                                             /**< (SDHC_EISTER) Masked  */
#define   SDHC_EISTER_CMDCRC_ENABLED_Val      _U_(0x1)                                             /**< (SDHC_EISTER) Enabled  */
#define SDHC_EISTER_CMDCRC_MASKED             (SDHC_EISTER_CMDCRC_MASKED_Val << SDHC_EISTER_CMDCRC_Pos) /**< (SDHC_EISTER) Masked Position  */
#define SDHC_EISTER_CMDCRC_ENABLED            (SDHC_EISTER_CMDCRC_ENABLED_Val << SDHC_EISTER_CMDCRC_Pos) /**< (SDHC_EISTER) Enabled Position  */
#define SDHC_EISTER_CMDEND_Pos                _U_(2)                                               /**< (SDHC_EISTER) Command End Bit Error Status Enable Position */
#define SDHC_EISTER_CMDEND_Msk                (_U_(0x1) << SDHC_EISTER_CMDEND_Pos)                 /**< (SDHC_EISTER) Command End Bit Error Status Enable Mask */
#define SDHC_EISTER_CMDEND(value)             (SDHC_EISTER_CMDEND_Msk & ((value) << SDHC_EISTER_CMDEND_Pos))
#define   SDHC_EISTER_CMDEND_MASKED_Val       _U_(0x0)                                             /**< (SDHC_EISTER) Masked  */
#define   SDHC_EISTER_CMDEND_ENABLED_Val      _U_(0x1)                                             /**< (SDHC_EISTER) Enabled  */
#define SDHC_EISTER_CMDEND_MASKED             (SDHC_EISTER_CMDEND_MASKED_Val << SDHC_EISTER_CMDEND_Pos) /**< (SDHC_EISTER) Masked Position  */
#define SDHC_EISTER_CMDEND_ENABLED            (SDHC_EISTER_CMDEND_ENABLED_Val << SDHC_EISTER_CMDEND_Pos) /**< (SDHC_EISTER) Enabled Position  */
#define SDHC_EISTER_CMDIDX_Pos                _U_(3)                                               /**< (SDHC_EISTER) Command Index Error Status Enable Position */
#define SDHC_EISTER_CMDIDX_Msk                (_U_(0x1) << SDHC_EISTER_CMDIDX_Pos)                 /**< (SDHC_EISTER) Command Index Error Status Enable Mask */
#define SDHC_EISTER_CMDIDX(value)             (SDHC_EISTER_CMDIDX_Msk & ((value) << SDHC_EISTER_CMDIDX_Pos))
#define   SDHC_EISTER_CMDIDX_MASKED_Val       _U_(0x0)                                             /**< (SDHC_EISTER) Masked  */
#define   SDHC_EISTER_CMDIDX_ENABLED_Val      _U_(0x1)                                             /**< (SDHC_EISTER) Enabled  */
#define SDHC_EISTER_CMDIDX_MASKED             (SDHC_EISTER_CMDIDX_MASKED_Val << SDHC_EISTER_CMDIDX_Pos) /**< (SDHC_EISTER) Masked Position  */
#define SDHC_EISTER_CMDIDX_ENABLED            (SDHC_EISTER_CMDIDX_ENABLED_Val << SDHC_EISTER_CMDIDX_Pos) /**< (SDHC_EISTER) Enabled Position  */
#define SDHC_EISTER_DATTEO_Pos                _U_(4)                                               /**< (SDHC_EISTER) Data Timeout Error Status Enable Position */
#define SDHC_EISTER_DATTEO_Msk                (_U_(0x1) << SDHC_EISTER_DATTEO_Pos)                 /**< (SDHC_EISTER) Data Timeout Error Status Enable Mask */
#define SDHC_EISTER_DATTEO(value)             (SDHC_EISTER_DATTEO_Msk & ((value) << SDHC_EISTER_DATTEO_Pos))
#define   SDHC_EISTER_DATTEO_MASKED_Val       _U_(0x0)                                             /**< (SDHC_EISTER) Masked  */
#define   SDHC_EISTER_DATTEO_ENABLED_Val      _U_(0x1)                                             /**< (SDHC_EISTER) Enabled  */
#define SDHC_EISTER_DATTEO_MASKED             (SDHC_EISTER_DATTEO_MASKED_Val << SDHC_EISTER_DATTEO_Pos) /**< (SDHC_EISTER) Masked Position  */
#define SDHC_EISTER_DATTEO_ENABLED            (SDHC_EISTER_DATTEO_ENABLED_Val << SDHC_EISTER_DATTEO_Pos) /**< (SDHC_EISTER) Enabled Position  */
#define SDHC_EISTER_DATCRC_Pos                _U_(5)                                               /**< (SDHC_EISTER) Data CRC Error Status Enable Position */
#define SDHC_EISTER_DATCRC_Msk                (_U_(0x1) << SDHC_EISTER_DATCRC_Pos)                 /**< (SDHC_EISTER) Data CRC Error Status Enable Mask */
#define SDHC_EISTER_DATCRC(value)             (SDHC_EISTER_DATCRC_Msk & ((value) << SDHC_EISTER_DATCRC_Pos))
#define   SDHC_EISTER_DATCRC_MASKED_Val       _U_(0x0)                                             /**< (SDHC_EISTER) Masked  */
#define   SDHC_EISTER_DATCRC_ENABLED_Val      _U_(0x1)                                             /**< (SDHC_EISTER) Enabled  */
#define SDHC_EISTER_DATCRC_MASKED             (SDHC_EISTER_DATCRC_MASKED_Val << SDHC_EISTER_DATCRC_Pos) /**< (SDHC_EISTER) Masked Position  */
#define SDHC_EISTER_DATCRC_ENABLED            (SDHC_EISTER_DATCRC_ENABLED_Val << SDHC_EISTER_DATCRC_Pos) /**< (SDHC_EISTER) Enabled Position  */
#define SDHC_EISTER_DATEND_Pos                _U_(6)                                               /**< (SDHC_EISTER) Data End Bit Error Status Enable Position */
#define SDHC_EISTER_DATEND_Msk                (_U_(0x1) << SDHC_EISTER_DATEND_Pos)                 /**< (SDHC_EISTER) Data End Bit Error Status Enable Mask */
#define SDHC_EISTER_DATEND(value)             (SDHC_EISTER_DATEND_Msk & ((value) << SDHC_EISTER_DATEND_Pos))
#define   SDHC_EISTER_DATEND_MASKED_Val       _U_(0x0)                                             /**< (SDHC_EISTER) Masked  */
#define   SDHC_EISTER_DATEND_ENABLED_Val      _U_(0x1)                                             /**< (SDHC_EISTER) Enabled  */
#define SDHC_EISTER_DATEND_MASKED             (SDHC_EISTER_DATEND_MASKED_Val << SDHC_EISTER_DATEND_Pos) /**< (SDHC_EISTER) Masked Position  */
#define SDHC_EISTER_DATEND_ENABLED            (SDHC_EISTER_DATEND_ENABLED_Val << SDHC_EISTER_DATEND_Pos) /**< (SDHC_EISTER) Enabled Position  */
#define SDHC_EISTER_CURLIM_Pos                _U_(7)                                               /**< (SDHC_EISTER) Current Limit Error Status Enable Position */
#define SDHC_EISTER_CURLIM_Msk                (_U_(0x1) << SDHC_EISTER_CURLIM_Pos)                 /**< (SDHC_EISTER) Current Limit Error Status Enable Mask */
#define SDHC_EISTER_CURLIM(value)             (SDHC_EISTER_CURLIM_Msk & ((value) << SDHC_EISTER_CURLIM_Pos))
#define   SDHC_EISTER_CURLIM_MASKED_Val       _U_(0x0)                                             /**< (SDHC_EISTER) Masked  */
#define   SDHC_EISTER_CURLIM_ENABLED_Val      _U_(0x1)                                             /**< (SDHC_EISTER) Enabled  */
#define SDHC_EISTER_CURLIM_MASKED             (SDHC_EISTER_CURLIM_MASKED_Val << SDHC_EISTER_CURLIM_Pos) /**< (SDHC_EISTER) Masked Position  */
#define SDHC_EISTER_CURLIM_ENABLED            (SDHC_EISTER_CURLIM_ENABLED_Val << SDHC_EISTER_CURLIM_Pos) /**< (SDHC_EISTER) Enabled Position  */
#define SDHC_EISTER_ACMD_Pos                  _U_(8)                                               /**< (SDHC_EISTER) Auto CMD Error Status Enable Position */
#define SDHC_EISTER_ACMD_Msk                  (_U_(0x1) << SDHC_EISTER_ACMD_Pos)                   /**< (SDHC_EISTER) Auto CMD Error Status Enable Mask */
#define SDHC_EISTER_ACMD(value)               (SDHC_EISTER_ACMD_Msk & ((value) << SDHC_EISTER_ACMD_Pos))
#define   SDHC_EISTER_ACMD_MASKED_Val         _U_(0x0)                                             /**< (SDHC_EISTER) Masked  */
#define   SDHC_EISTER_ACMD_ENABLED_Val        _U_(0x1)                                             /**< (SDHC_EISTER) Enabled  */
#define SDHC_EISTER_ACMD_MASKED               (SDHC_EISTER_ACMD_MASKED_Val << SDHC_EISTER_ACMD_Pos) /**< (SDHC_EISTER) Masked Position  */
#define SDHC_EISTER_ACMD_ENABLED              (SDHC_EISTER_ACMD_ENABLED_Val << SDHC_EISTER_ACMD_Pos) /**< (SDHC_EISTER) Enabled Position  */
#define SDHC_EISTER_ADMA_Pos                  _U_(9)                                               /**< (SDHC_EISTER) ADMA Error Status Enable Position */
#define SDHC_EISTER_ADMA_Msk                  (_U_(0x1) << SDHC_EISTER_ADMA_Pos)                   /**< (SDHC_EISTER) ADMA Error Status Enable Mask */
#define SDHC_EISTER_ADMA(value)               (SDHC_EISTER_ADMA_Msk & ((value) << SDHC_EISTER_ADMA_Pos))
#define   SDHC_EISTER_ADMA_MASKED_Val         _U_(0x0)                                             /**< (SDHC_EISTER) Masked  */
#define   SDHC_EISTER_ADMA_ENABLED_Val        _U_(0x1)                                             /**< (SDHC_EISTER) Enabled  */
#define SDHC_EISTER_ADMA_MASKED               (SDHC_EISTER_ADMA_MASKED_Val << SDHC_EISTER_ADMA_Pos) /**< (SDHC_EISTER) Masked Position  */
#define SDHC_EISTER_ADMA_ENABLED              (SDHC_EISTER_ADMA_ENABLED_Val << SDHC_EISTER_ADMA_Pos) /**< (SDHC_EISTER) Enabled Position  */
#define SDHC_EISTER_Msk                       _U_(0x03FF)                                          /**< (SDHC_EISTER) Register Mask  */

/* EMMC mode */
#define SDHC_EISTER_EMMC_BOOTAE_Pos           _U_(12)                                              /**< (SDHC_EISTER) Boot Acknowledge Error Status Enable Position */
#define SDHC_EISTER_EMMC_BOOTAE_Msk           (_U_(0x1) << SDHC_EISTER_EMMC_BOOTAE_Pos)            /**< (SDHC_EISTER) Boot Acknowledge Error Status Enable Mask */
#define SDHC_EISTER_EMMC_BOOTAE(value)        (SDHC_EISTER_EMMC_BOOTAE_Msk & ((value) << SDHC_EISTER_EMMC_BOOTAE_Pos))
#define SDHC_EISTER_EMMC_Msk                  _U_(0x1000)                                           /**< (SDHC_EISTER_EMMC) Register Mask  */


/* -------- SDHC_NISIER : (SDHC Offset: 0x38) (R/W 16) Normal Interrupt Signal Enable -------- */
#define SDHC_NISIER_RESETVALUE                _U_(0x00)                                            /**<  (SDHC_NISIER) Normal Interrupt Signal Enable  Reset Value */

